abdelrahman-yousry/Ignition_System/SystemDrivers/MCAL/NVIC_Driver_V1/stm32f401xc_IRQs.h
/*
 * stm32f401xc_IRQs.h
 *
 *  Created on: Apr 24, 2022
 *      Author: Muhammed
 */

#ifndef STM32F401XC_IRQS_H_
#define STM32F401XC_IRQS_H_

#define WWDG_IRQn                   NVIC_u8IRQ_NUM_0
#define PVD_IRQn                    NVIC_u8IRQ_NUM_1
#define TAMP_STAMP_IRQn             NVIC_u8IRQ_NUM_2
#define RTC_WKUP_IRQn               NVIC_u8IRQ_NUM_3
#define FLASH_IRQn                  NVIC_u8IRQ_NUM_4
#define RCC_IRQn                    NVIC_u8IRQ_NUM_5
#define EXTI0_IRQn                  NVIC_u8IRQ_NUM_6
#define EXTI1_IRQn                  NVIC_u8IRQ_NUM_7
#define EXTI2_IRQn                  NVIC_u8IRQ_NUM_8
#define EXTI3_IRQn                  NVIC_u8IRQ_NUM_9
#define EXTI4_IRQn                  NVIC_u8IRQ_NUM_10
#define DMA1_Stream0_IRQn           NVIC_u8IRQ_NUM_11
#define DMA1_Stream1_IRQn           NVIC_u8IRQ_NUM_12
#define DMA1_Stream2_IRQn           NVIC_u8IRQ_NUM_13
#define DMA1_Stream3_IRQn           NVIC_u8IRQ_NUM_14
#define DMA1_Stream4_IRQn           NVIC_u8IRQ_NUM_15
#define DMA1_Stream5_IRQn           NVIC_u8IRQ_NUM_16
#define DMA1_Stream6_IRQn           NVIC_u8IRQ_NUM_17
#define ADC_IRQn                    NVIC_u8IRQ_NUM_18
#define EXTI9_5_IRQn                NVIC_u8IRQ_NUM_23
#define TIM1_BRK_TIM9_IRQn          NVIC_u8IRQ_NUM_24
#define TIM1_UP_TIM10_IRQn          NVIC_u8IRQ_NUM_25
#define TIM1_TRG_COM_TIM11_IRQn     NVIC_u8IRQ_NUM_26
#define TIM1_CC_IRQn                NVIC_u8IRQ_NUM_27
#define TIM2_IRQn                   NVIC_u8IRQ_NUM_28
#define TIM3_IRQn                   NVIC_u8IRQ_NUM_29
#define TIM4_IRQn                   NVIC_u8IRQ_NUM_30
#define I2C1_EV_IRQn                NVIC_u8IRQ_NUM_31
#define I2C1_ER_IRQn                NVIC_u8IRQ_NUM_32
#define I2C2_EV_IRQn                NVIC_u8IRQ_NUM_33
#define I2C2_ER_IRQn                NVIC_u8IRQ_NUM_34
#define SPI1_IRQn                   NVIC_u8IRQ_NUM_35
#define SPI2_IRQn                   NVIC_u8IRQ_NUM_36
#define USART1_IRQn                 NVIC_u8IRQ_NUM_37
#define USART2_IRQn                 NVIC_u8IRQ_NUM_38
#define EXTI15_10_IRQn              NVIC_u8IRQ_NUM_40
#define RTC_Alarm_IRQn              NVIC_u8IRQ_NUM_41
#define OTG_FS_WKUP_IRQn            NVIC_u8IRQ_NUM_42
#define DMA1_Stream7_IRQn           NVIC_u8IRQ_NUM_47
#define SDIO_IRQn                   NVIC_u8IRQ_NUM_49
#define TIM5_IRQn                   NVIC_u8IRQ_NUM_50
#define SPI3_IRQn                   NVIC_u8IRQ_NUM_51
#define DMA2_Stream0_IRQn           NVIC_u8IRQ_NUM_56
#define DMA2_Stream1_IRQn           NVIC_u8IRQ_NUM_57
#define DMA2_Stream2_IRQn           NVIC_u8IRQ_NUM_58
#define DMA2_Stream3_IRQn           NVIC_u8IRQ_NUM_59
#define DMA2_Stream4_IRQn           NVIC_u8IRQ_NUM_60
#define OTG_FS_IRQn                 NVIC_u8IRQ_NUM_67
#define DMA2_Stream5_IRQn           NVIC_u8IRQ_NUM_68
#define DMA2_Stream6_IRQn           NVIC_u8IRQ_NUM_69
#define DMA2_Stream7_IRQn           NVIC_u8IRQ_NUM_70
#define USART6_IRQn                 NVIC_u8IRQ_NUM_71
#define I2C3_EV_IRQn                NVIC_u8IRQ_NUM_72
#define I2C3_ER_IRQn                NVIC_u8IRQ_NUM_73
#define FPU_IRQn                    NVIC_u8IRQ_NUM_81
#define SPI4_IRQn                   NVIC_u8IRQ_NUM_84



#endif /* STM32F401XC_IRQS_H_ */
